app/Controllers/buskidicoin/admin.php

SELECT *
FROM `account`
ORDER BY `account_id` ASC
---
    public function see_all_data()
    {
        $data = $this->modelAccount->orderBy('account_id', 'asc')->findAll();