app/Controllers/buskidicoin/publics.php

INSERT INTO `account` (`account_username`, `account_password`, `account_pin`) VALUES ('asd', 'asd', '1233')
---
    public function register()
    {
        /*if($this->request->getPost()){
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');
        }
        $response = [
            'status'    => $this->request->getVar()
        ];
        return $this->respond($this->request->getVar());*/

        $data = [
            'account_username'  => $this->request->getPost('username'),
            'account_password'  => $this->request->getPost('password'),
            'account_pin'       => $this->request->getPost('pin'),
            'nomer_hp'          => $this->request->getPost('nomer_hp'),
        ];
        if (!$this->modelAccount->save($data)) {