buskidistore/app/Models/ModelAccount.php

    function getDataWhereId($id)
    {
        $builder = $this->table('account');
        $builder->where('account_id', $id);
        $data = $builder->first();
---
SELECT *
FROM `account`
WHERE `account_id` = '4'
 LIMIT 1