app/Models/item_m.php

SELECT *
FROM `item_m`
JOIN `account_m` ON `item_m`.`id_seller` = `account_m`.`id_user`
---
    public function see_all()
    {
        $builder = $this->table('item_m');
        $builder->select('*');
        $builder->join('account_m', 'item_m.id_seller = account_m.id_user');
        $query = $builder->get();