app/Models/ModelAccount_m.php

SELECT *
FROM `account_m`
WHERE `username` = 'kel2_dipidi'
AND `password` = 'dipidi123'
 LIMIT 1
---
    function verifyLogin($username, $password)
    {
        $builder = $this->table('account_m');
        $builder->where('username', $username);
        $builder->where('password', $password);
        $data = $builder->first();