app/Models/ModelBuy_m.php

    public function see_order($id_seller)
    {
        $builder = $this->table('buy_m');
        $builder->select('*');
        $builder->join('account_m', 'account_m.id_user = buy_m.id_buyer', 'LEFT');
        $builder->join('item_m', 'item_m.id_item = buy_m.id_item', 'LEFT');
        $builder->where('buy_m.id_seller', $id_seller);
        $builder->where('buy_m.status', '1');
        $query = $builder->get();
---
SELECT *
FROM `buy_m`
LEFT JOIN `account_m` ON `account_m`.`id_user` = `buy_m`.`id_buyer`
LEFT JOIN `item_m` ON `item_m`.`id` = `buy_m`.`id_item`
WHERE `buy_m`.`id_seller` = '1'
AND `buy_m`.`status` = '1'