app/Models/ModelAccount.php

SELECT *
FROM `account`
WHERE `account_username` = 'admin'
AND `account_password` = 'admin'
 LIMIT 1
---
    function verifyLogin($username, $password)
    {
        $builder = $this->table('account');
        $builder->where('account_username', $username);
        $builder->where('account_password', $password);
        $data = $builder->first();